---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ProfileFailures
source: html/447482b4-1ba9-f50f-4311-1ecd034d844d.htm
---
# BuiltInFailures.ProfileFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.